# Data Analysis & Pandas
## What is Data Analysis?
Data Analysis is a method of collecting and organizing the data and, if required, manipulating the data so that one can derive some useful information from the data.
## What is Pandas?
* Officially stands for Python Data Analysis Library
* It is an open-source Python library
* It is a tool used by data scientists to: read, write, manipulate, and analyze the data.

In [1]:
# Importing Pandas
import pandas as pd

## Series
one-dimensional labeled array

In [2]:
#  Creating a series using list of elements
 
l = [1, 1, 2, 3, 5, 8, 13]
l = pd.Series(l)
l

0     1
1     1
2     2
3     3
4     5
5     8
6    13
dtype: int64

In [3]:
#  Creating a series using dictionary

l = { 'one': 1, 'two': 2, 'three': 3, 'four': 4, 'five': 5, 'six': 6, 'seven': 7}
l = pd.Series(l)
l

one      1
two      2
three    3
four     4
five     5
six      6
seven    7
dtype: int64

In [12]:
l.values

array([1, 2, 3, 4, 5, 6, 7], dtype=int64)

In [14]:
l.index

Index(['one', 'two', 'three', 'four', 'five', 'six', 'seven'], dtype='object')

index are inmutable

## DataFrame
* two-dimensional table
* a DataFrame is a collection of Series

In [5]:
data = [[1000, 'Steve', 86.29],
        [1001, 'Mathew', 91.63],
        [1002, 'Jose', 72.90],
        [1003, 'Patty', 69.23],
        [1004, 'Vin', 88.30]]
dF = pd.DataFrame(data, columns=['Regd. No', 'Name', 'Marks%'], index=[1,2,3,4,5])
dF

   Regd. No    Name  Marks%
1      1000   Steve   86.29
2      1001  Mathew   91.63
3      1002    Jose   72.90
4      1003   Patty   69.23
5      1004     Vin   88.30

In [6]:
data = {'Regd. No':[1000,1001,1002,1003,1004],
        'Names':['Steve', 'Mathew', 'Jose', 'Patty', 'Vin'],
        'Marks%':[86.29, 91.63, 72.90, 69.23, 88.30]}

dF = pd.DataFrame(data)
dF

   Regd. No   Names  Marks%
0      1000   Steve   86.29
1      1001  Mathew   91.63
2      1002    Jose   72.90
3      1003   Patty   69.23
4      1004     Vin   88.30

In [10]:
Regd_No= [1000,1001,1002,1003,1004]
Names=['Steve', 'Mathew', 'Jose', 'Patty', 'Vin']
data = pd.DataFrame({'Regd. No' : Regd_No,
        'Names' : Names})

data

   Regd. No   Names
0      1000   Steve
1      1001  Mathew
2      1002    Jose
3      1003   Patty
4      1004     Vin

## Slicing in Series

In [20]:
l.loc['one']

1

In [21]:
l.loc['two':]

two      2
three    3
four     4
five     5
six      6
seven    7
dtype: int64

In [22]:
l.loc['two':'six']

two      2
three    3
four     4
five     5
six      6
dtype: int64

In [26]:
l.iloc[1]

2

## Slicing in DataFrame

In [23]:
data['Names']

0     Steve
1    Mathew
2      Jose
3     Patty
4       Vin
Name: Names, dtype: object

In [24]:
data.Names

0     Steve
1    Mathew
2      Jose
3     Patty
4       Vin
Name: Names, dtype: object

In [27]:
data.iloc[2:4]

   Regd. No  Names
2      1002   Jose
3      1003  Patty

In [28]:
data.loc[2:4]

   Regd. No  Names
2      1002   Jose
3      1003  Patty
4      1004    Vin

In [29]:
data.iloc[2]

Regd. No    1002
Names       Jose
Name: 2, dtype: object

In [30]:
data.loc[2]

Regd. No    1002
Names       Jose
Name: 2, dtype: object